Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.SetOptions Method
Overload List
Name | Description
SetOptions(ClashCheckOptions)
 Sets the clash check options.
SetOptions(ComponentOptions)
 Sets the component options.
Top
See Also
Reference
TeklaStructuresSettings Class
Tekla.Structures Namespace